In [1]:
import pandas as pd

In [4]:
h=('uday','17-11-1997','male')
s=pd.Series(h)
s

0          uday
1    17-11-1997
2          male
dtype: object

In [6]:
pd.Series()

Series([], dtype: float64)

In [11]:
import numpy as np
d=np.arange(5)
p=pd.Series(d,index=[9,8,7,5,4])
p

9    0
8    1
7    2
5    3
4    4
dtype: int32

In [17]:
n={'a':1,'b':2,'c':3}
pd.Series(n,index=['a','b','c'])

a    1
b    2
c    3
dtype: int64

In [26]:
m=pd.Series([1,2,3,4],index=['a','b','c','d'])
m

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
l=pd.Series(5,index=[1,2,3,4])
l

1    5
2    5
3    5
4    5
dtype: int64

In [37]:
l[4]

5

In [31]:
m[0]

1

In [39]:
m[:3]

a    1
b    2
c    3
dtype: int64

In [40]:
m[-3:]

b    2
c    3
d    4
dtype: int64

In [48]:
print(m)
m[-2:]

a    1
b    2
c    3
d    4
dtype: int64

c    3
d    4
dtype: int64

In [50]:
m['b']

2

In [53]:
data=[[1,1000],[2,2000],[3,3000]]
d=pd.DataFrame(data,index=['a','b','c'],columns=['one','two'])
print(d)

   one   two
a    1  1000
b    2  2000
c    3  3000

In [60]:
data={'name':[1,2,3,4,5],'age':[100,200,300,400,500]}
d=pd.DataFrame(data,index=['a','b','c','d','e'])
d

   name  age
a     1  100
b     2  200
c     3  300
d     4  400
e     5  500

In [72]:
data=[{1:100,2:200,3:300,4:400},{5:500,6:600,7:700},{5:500,6:600,7:700}]
l=pd.DataFrame(data)

In [64]:
d={'one':pd.DataFrame(data)
  ,'two':pd.DataFrame(data)}
d

{'one':        1      2      3      4      5      6      7
 0  100.0  200.0  300.0  400.0    NaN    NaN    NaN
 1    NaN    NaN    NaN    NaN  500.0  600.0  700.0
 2    NaN    NaN    NaN    NaN  500.0  600.0  700.0,
 'two':        1      2      3      4      5      6      7
 0  100.0  200.0  300.0  400.0    NaN    NaN    NaN
 1    NaN    NaN    NaN    NaN  500.0  600.0  700.0
 2    NaN    NaN    NaN    NaN  500.0  600.0  700.0}

In [66]:
d['two']

       1      2      3      4      5      6      7
0  100.0  200.0  300.0  400.0    NaN    NaN    NaN
1    NaN    NaN    NaN    NaN  500.0  600.0  700.0
2    NaN    NaN    NaN    NaN  500.0  600.0  700.0

In [75]:
l.iloc[0]

1    100.0
2    200.0
3    300.0
4    400.0
5      NaN
6      NaN
7      NaN
Name: 0, dtype: float64

In [79]:
l.drop(2)

       1      2      3      4      5      6      7
0  100.0  200.0  300.0  400.0    NaN    NaN    NaN
1    NaN    NaN    NaN    NaN  500.0  600.0  700.0